app/controllers/weekly_plans_controller.rb

UPDATE "weekly_plans" SET "data" = ?, "updated_at" = ? WHERE "weekly_plans"."id" = ?
---
  def update
    respond_to do |format|
      if @weekly_plan.update(weekly_plan_params)

INSERT INTO "weekly_plans" ("data", "year", "week_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["data", nil], ["year", 44], ["week_number", 2023], ["created_at", "2023-10-30 17:47:57.187082"], ["updated_at", "2023-10-30 17:47:57.187082"]]
SELECT "weekly_plans".* FROM "weekly_plans" WHERE "weekly_plans"."week_number" = ? AND "weekly_plans"."year" = ? ORDER BY "weekly_plans"."id" ASC LIMIT ?  [["week_number", 2023], ["year", 44], ["LIMIT", 1]]
SELECT "weekly_plans".* FROM "weekly_plans" WHERE "weekly_plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_weekly_plan
      if params[:id].to_s.include?("-")
        year, week_number = params[:id].split("-")
        @weekly_plan = WeeklyPlan.where(week_number: week_number, year: year).first_or_create
      else
        @weekly_plan = WeeklyPlan.find_by_id(params[:id])